[Killed] BlockStatement
basic-check/test-suite-check/src/Queue.ts:8:23
     this._store.push(...initialData);
   }
 
-  public push(val: T) {
-    this._store.push(val);
-  }
+  public push(val: T) {}
 
   public pop(): T | undefined {

[Killed] BlockStatement
basic-check/test-suite-check/src/Queue.ts:12:31
     this._store.push(val);
   }
 
-  public pop(): T | undefined {
-    return this._store.shift();
-  }
+  public pop(): T | undefined {}
 
   public isEmpty(): boolean {

[Killed] BlockStatement
basic-check/test-suite-check/src/Queue.ts:16:29
     return this._store.shift();
   }
 
-  public isEmpty(): boolean {
-    return this.size() === 0;
-  }
+  public isEmpty(): boolean {}
 
   public size(): number {

[Killed] EqualityOperator
basic-check/test-suite-check/src/Queue.ts:17:12
   }
 
   public isEmpty(): boolean {
-    return this.size() === 0;
+    return this.size() !== 0;
   }
 

[Killed] ConditionalExpression
basic-check/test-suite-check/src/Queue.ts:17:12
   }
 
   public isEmpty(): boolean {
-    return this.size() === 0;
+    return true;
   }
 

[Killed] BlockStatement
basic-check/test-suite-check/src/Queue.ts:20:25
     return this.size() === 0;
   }
 
-  public size(): number {
-    return this._store.length;
-  }
+  public size(): number {}
 }
 
